Repository: debian-live/live-manual
Catalog: manual/po/*/project_coding-style.ssi.po
Languages: it

source: :B~ Coding Style
it: :B~ Lo stile nello scrivere codice

source: 1~coding-style Coding Style
it: 1~coding-style Lo stile nello scrivere codice

source: 2~ Compatibility
it: 2~ Compatibilità

source: _* Don't use syntax or semantics that are unique to the Bash shell. For example, the use of array constructs.
it: _* Non usare sintassi o semantiche mirate alla shell Bash. Ad esempio l'uso di costrutti array.

source: _* Only use the POSIX subset - for example, use $(foo) over `foo`.
it: _* Utilizzare solo il sottoinsieme POSIX - ad esempio, usare $(foo) invece di `foo`.

source: _* You can check your scripts with 'sh -n' and 'checkbashisms'.
it: _* È possibile verificare i propri script con "sh -n" e "checkbashisms".

source: _* Make sure all shell code runs with 'set -e'.
it: Assicurarsi che tutto il codice giri con 'set -e'.

source: 2~ Indenting
it: 2~ Rientri

source: _* Always use tabs over spaces.
it: _* Usare sempre i tab piuttosto che gli spazi.

source: 2~ Wrapping
it: 2~ Ritorno a capo

source: _* Generally, lines are 80 chars at maximum.
it: _* Generalmente le righe sono composte da un massimo di 80 caratteri.

source: _* Use the "Linux style" of line breaks:
it: _* Utilizzare lo "stile Linux" per le interruzioni di riga:

source: Bad:
it: Sbagliato:

source: Good:
it: Corretto:

source: _* The same holds for functions:
it: _* Lo stesso vale per le funzioni:

source: 2~ Variables
it: 2~ Variabili

source: _* Variables are always in capital letters.
it: _* Le variabili vanno sempre scritte in maiuscolo.

source: _* Variables used in live-build always start with #{LB_}# prefix.
it: _* Le variabili usate in live-build iniziano sempre con il prefisso #{LB_}#.

source: _* Internal temporary variables in live-build should start with the #{\_LB_}# prefix.
it: _* Le variabili interne temporanee in live-build dovrebbero iniziare con il prefisso #{\_LB_}#.

source: _* Local variables start with live-build #{\_\_LB_}# prefix.
it: _* Le variabili locali iniziano con il prefisso live-build #{\_\_LB_}#.

source: _* Variables in connection to a boot parameter in live-config start with #{LIVE_}#.
it: _* Le variabili in live-config relative ai parametri di avvio iniziano con #{LIVE_}#.

source: _* All other variables in live-config start with #{_}# prefix.
it: _* Tutte le altre variabili in live-config iniziano con il prefisso #{_}#.

source: _* Use braces around variables; e.g. write #{${FOO}}# instead of #{$FOO}#.
it: _* Intorno alle variabili utilizzare le graffe; ad esempio scrivere #{${FOO}}# invece di #{$FOO}#.

source: _* Always protect variables with quotes to respect potential whitespaces: write #{"${FOO}"}# not #{${FOO}}#.
it: _* Proteggere sempre le variabili con le virgolette per rispettare potenziali spaziature: scrivere #{"${FOO}"}# e non #{${FOO}}#.

source: _* For consistency reasons, always use quotes when assigning values to variables:
it: _* Per coerenza usare sempre le virgolette quando si assegnano valori alle variabili:

source: _* If multiple variables are used, quote the full expression:
it: _* Utilizzando variabili multiple, quotare l'intera espressione:

source: 2~ Miscellaneous
it: 2~ Varie

source: _* Use "#{|}#" (without the surround quotes) as a separator in calls to sed, e.g. "#{sed -e 's|foo|bar|'}#" (without "").
it: _* Per le chiamate a sed utilizzare "#{|}#" (senza virgolette intorno) come separatore, ad esempio "#{sed -e 's|foo|bar|'}#" (senza "").

source: _* Don't use the #{test}# command for comparisons or tests, use "#{[}#" "#{]}#" (without ""); e.g. "#{if [ -x /bin/foo ]; ...}#" and not "#{if test -x /bin/foo; ...}#".
it: _* Non utilizzare il comando #{test}# per prove o confronti, usare "#{[}#" "#{]}#" (senza ""); ad esempio "#{if [ -x /bin/foo ]; ...}#" e non "#{if test -x /bin/foo; ...}#".

source: _* Use #{case}# wherever possible over #{test}#, as it's easier to read and faster in execution.
it: _* Ove possibile utilizzare #{case}# invece di #{test}#, essendo più facile da leggere e più veloce in esecuzione.

source: _* Use capitalized names for functions to limit messing with the users environment.
it: _* Per le funzioni utilizzare nomi che iniziano con la maiuscola per limitare i problemi con le variabili d'ambiente dell'utente.
