Repository: debian-live/live-manual
Catalog: manual/po/*/user_installation.ssi.po
Languages: pl

source: :B~ Installation
pl: :B~ Instalacja

source: 1~installation Installation
pl: 1~installation Instalacja

source: 2~requirements Requirements
pl: 2~requirements Wymagania

source: Building live system images has very few system requirements:
pl: Budowanie obrazów systemu live ma bardzo niewielkie wymagania systemowe:

source: _* Superuser (root) access
pl: _* Dostęp do konta (root) super-użytkownika

source: _* An up-to-date version of live-build
pl: _* Aktualna wersja live-build

source: _* A POSIX-compliant shell, such as /{bash}/ or /{dash}/
pl: _* Powłoka zgodna z POSIX, taka jak /{bash}/ lub /{dash}/

source: _* /{debootstrap}/ or /{cdebootstrap}/
pl: _* /{debootstrap}/ lub /{cdebootstrap}/

source: _* Linux 2.6 or newer.
pl: _* Linux 2.6 lub nowszy.

source: Note that using Debian or a Debian-derived distribution is not required - live-build will run on almost any distribution with the above requirements.
pl: Należy pamiętać, że użycie Debiana lub dystrybucji pochodzącej od Debian nie jest wymagane - live-build będzie działać na prawie każdej dystrybucji spełniającej powyższe wymagania.

source: 2~installing-live-build Installing live-build
pl: 2~installing-live-build Instalowanie live-build

source: You can install live-build in a number of different ways:
pl: Możesz zainstalować live-build na wiele różnych sposobów:

source: _* From the Debian repository
pl: _* Z repozytorium Debiana

source: _* From source
pl: _* Ze źródła

source: _* From snapshots
pl: _* Ze zrzutów deweloperskich

source: If you are using Debian, the recommended way is to install live-build via the Debian repository.
pl: Jeśli używasz Debiana, zalecanym sposobem jest zainstalowanie live-build poprzez repozytorium Debiana.

source: 3~ From the Debian repository
pl: 3~ Z repozytorium Debiana

source: Simply install live-build like any other package:
pl: Zwyczajnie zainstaluj live-build jak każdą inną paczkę:

source: 3~ From source
pl: 3~ Ze źródła

source: live-build is developed using the Git version control system. On Debian based systems, this is provided by the /{git}/ package. To check out the latest code, execute:
pl: live-build jest opracowana z wykorzystaniem systemu kontroli wersji Git. W systemach opartych na Debianie, jest on dostarczany przez pakiet /{git}/. Aby sprawdzić najnowszy kod, wykonaj:

source: You can build and install your own Debian package by executing:
pl: Możesz zbudować i zainstalować własną paczkę Debiana wykonując:

source: Now install whichever of the freshly built #{.deb}# files you were interested in, e.g.
pl: Teraz zainstaluj którąkolwiek świeżo zbudowaną paczkę #{.deb}, wedle wyboru, np.

source: You can also install live-build directly to your system by executing:
pl: Możesz również zainstalować live-build bezpośrednio w swoim systemie wykonując:

source: and uninstall it with:
pl: i odinstalować go wykonując:

source: 3~ From 'snapshots'
pl: 3~ Ze zrzutów deweloperskich

source: If you do not wish to build or install live-build from source, you can use snapshots. These are built automatically from the latest version in Git and are available on http://live-systems.org/debian/.
pl: Jeśli nie chcesz, kompilować i zainstalować live-build ze źródła, możesz użyć zrzutów deweloperskich. Są to automatycznie zbudowane paczki z najnowszej wersji Git i są one dostępne na http://live-systems.org/debian/.

source: 2~ Installing live-boot and live-config
pl: 2~ Instalowanie live-boot i live-config

source: *{Note:}* You do not need to install live-boot or live-config on your system to create customized live systems. However, doing so will do no harm and is useful for reference purposes. If you only want the documentation, you may now install the /{live-boot-doc}/ and /{live-config-doc}/ packages separately.
pl: *{Uwaga:}* Nie musisz instalować live-boot lub live-config w systemie do tworzenia niestandardowych systemów żywych. Jednak ten sposób nie zaszkodzi i jest przydatny do celów porównawczych. Jeśli chcesz tylko przejrzeć dokumentację, możesz zainstalować pakiety /{live-boot-doc}/ i /{live-config-doc}/ oddzielnie.

source: Both live-boot and live-config are available from the Debian repository as per {Installing live-build}#installing-live-build.
pl: Zarówno live-boot oraz live-config są dostępne w repozytorium Debiana, tak jak w {instalacji live-build}#installing-live-build.

source: To use the latest source from git, you can follow the process below. Please ensure you are familiar with the terms mentioned in {Terms}#terms.
pl: Aby używać najnowszych źródeł z repozytorium GIT, użyj poniższego polecenia. Proszę upewnij się, że zapoznałeś się z warunkami wymienionymi w {Warunkach}#terms.

source: _* Checkout the live-boot and live-config sources
pl: _* Sklonuj źródła live-boot i live-config

source: Consult the live-boot and live-config man pages for details on customizing if that is your reason for building these packages from source.
pl: Poradź się podręcznikiem man pakietół live-boot i live-config aby uzyskać szczegółowe informacje na temat dostosowywania, jeżeli to jest Twój powód do budowania tych pakietów ze źródeł.

source: _* Build live-boot and live-config .deb files
pl: _* Zbuduj pliki .deb live-boot i live-config

source: You must build either on your target distribution or in a chroot containing your target platform: this means if your target is ${testing} then you should build against ${testing}.
pl: Musisz budować obraz albo na dystrybucji docelowej lub w środowisku chroot zawierającym platformę docelowej: oznacza to, czy celem jest ${testing} to obraz należy budować na ${testing}.

source: Use a personal builder such as /{pbuilder}/ or /{sbuild}/ if you need to build live-boot for a target distribution that differs from your build system. For example, for ${testing} live images, build live-boot in a ${testing} chroot. If your target distribution happens to match your build system distribution, you may build directly on the build system using #{dpkg-buildpackage}# (provided by the /{dpkg-dev}/ package):
pl: Używaj osobistych konstruktorów takich jak /{pbuilder}/ lub /{sbuild}/, jeżeli istnieje potrzeba zbudowania live-boot na dystrybucji docelowej, która różni się od systemu budowania. Na przykład, dla obrazów ${testing} live, zbuduj live-boot w środowisku chroot ${testing}. Jeśli dystrybucja docelowa zgadza się z dystrybucją systemu kompilacji, można wtedy zbudować bezpośrednio na wbudowanym systemie, używając #{dpkg-buildpackage}# (dostarczanego przez pakiet /{dpkg-dev}/):

source: You can let live-build automatically use the latest snapshots of live-boot and live-config by configuring the package repository on live-systems.org as a third-party repository in your live-build configuration directory.
pl: Możesz pozwolić live-build automatycznie skorzystać z najnowszych zrzutów deweloperskich live-boot i live-live-config przez skonfigurowanie repozytorium pakietu live-systems.org jako repozytorium innych firm w katalogu konfiguracyjnym live-build.
